{    
    "translation": {
        "slate": "Slate",
        "dark": "Dark Zinc",
        "teal":"Teal",
        "gray":"Gray",
        "system": "System",
        "sun":"sun",
        "info-sun":"The Sun is the star of the solar system. All celestial bodies in this system, including Earth The Sun is the star of the solar system It has a diameter of 1,392 mi km.",
        "earth": "earth",
        "info-earth":"The Earth was formed about 4.5 billion years ago, is located in the middle of the Milky Way, being the third closest planet to the Sun, distance 149,600,000.",
        "mars":"mars",
        "info-mars":"The planet Mars is the fourth closest to the Sun Mars has two moons called Phobos and Deimos distance from the sun 227,940,000",
        "welcome": "Welcome to my Portfolio!",
        "presentation": "Hello my name is",
        "about": "I have a passion for the area of ​​Programming and I am determined to conquer my space. Feel free to explore my planetary portfolio and discover my work.",
        "curriculum":"Curriculum",
        "start": "Start",
        "aboutBtn": "About",
        "skills": "Skills",
        "project": "Project",
        "comment":"Comment",
        "hiring": "hire me",
        "name": "Name",
        "email": "E-mail",
        "message": "Message",
        "toSend": "To send",

        "exploration-about-me": "Exploration about me",
        "country-state": "Brazil - São Paulo",
        "btn-explore-city": "Explore my city",
        "info-img": "+ information just click on the image",
        "about-where-I-live": "Born in Suzano, I was born into a family of warriors, with my parents and five brothers. Today, After much perseverance and achievements, We have been proudly residing in the same city of Ferraz de Vasconcelos for over 22 years.",
        "info-city": "I live in the state of São Paulo - IBGE population 21.9%",
        "information-ships": "Informations - Ships",
        "choose-your-spaceship": "Choose your spaceship",
        "cargo-spaceship": "Cargo spaceship",
        "title-choose-your-spaceship": "Choose spaceship to explore planet Portfolio",
        "resistance-spaceship": "Resistance Spaceship",
        "power-spaceship": "Power spaceship",
        "agility-spaceship": "Agility spaceship",
        "speed-spaceship": "Speed spaceship",
        "camouflage-spaceship": "Camouflage spaceship",
        "level": "Level",
        "origin": "Origin",
        "dream-career": "Dream - Career",
        "dream-profession": "Choose your dream profession",
        "dream": "My dream is to be a front-end programmer",
        "coffee": "coffee",
        "dexterity": "dexterity",
        "sleep": "sleep",
        "intelligence": "intelligence",
        "dreamy": "dreamy",
        "choose-dream": "Choose your dream profession",
        "doctor": "doctor",
        "attorney": "attorney",
        "pilot": "pilote",
        "developer": "programmer",
        "teacher": "teacher",
        "fireman": "Fireman",
        "character":"select from character",

        "title-skills": "Skills",
        "info-img-click": "+ information click on the images",
        "javascript": "I started my programming journey with programming logic by watching the videos of Guanabara on Visualg. Over time, I improved my knowledge and moved on to JavaScript. At first, it was challenging to understand how to work with events, classes and objects, but with determination and perseverance, I began to understand these concepts. Today, I am able to create applications using JavaScript with confidence.",
        "period": "period",
        "years": "years",
        "year": "year",
        "months": "months",
        "html": "HMTL (HyperText Markup Language): It was the first time I put an 'h1' with the message ' Hello, World! ' in the code. I will never forget that moment; I was immensely happy to see something so simple, but impactful, appear on the browser screen. This was one of the pioneering moments that strengthened my passion for front-end development.",
        "css": "CSS is an incredible tool for everyone who dreams of becoming a front-end. We know how impressive she can be when it comes to styling elements. On my way, I faced many difficulties in the flexbox part, But with a lot of perseverance, I managed to learn, and today, styling components has become one of the most rewarding things to do. Currently, I use Styled-Components and Tailwind CSS.",
        "typescript": "I'm starting to gain more confidence in creating TypeScript applications, especially due to the security provided by the types. I feel that with TypeScript, I have the ability to develop larger applications with more peace of mind.",
        "node": "I really like front-end development, but I recognize that a good developer needs to understand how data is transmitted. Therefore, I started studying Node.js to understand how the backend works and, at the same time, create projects that integrate the frontend and the backend.",
        "react": "React was the library with which I identified most, both for the way it organizes folders and for the way of managing routes and libraries that you can add to your projects to make things easier. It is currently the library which I like the most.",
        "next": "I'm getting familiar with Next.js, a framework that follows the same structure as React, and I'm not having any difficulties. I will probably use this framework in my future projects, as the way it handles deployment is very simple. and effective to publicize my projects.",
        "sqlite": "When I develop applications that involve the front-end and back-end, I really appreciate using SQLite3 due to its simplicity in the database connection. Currently, I prefer to use both MySQL and SQLite3.",
        
        "missions": "completed missions",
        "title-project": "project",
        "text-projects": "This project allows users to create their own English sentences, passing through several validations, including detection of identical phrases, sentences of less than three words and the ability to filter, page delete and even edit sentences. Furthermore, offers a practice option to improve English skills.",
        "hardware": "hardware",
        "code": "project code",
        "see": "watch the project video",
        "see-the-project": "see the project",
        "text-project-sigma": "Users will have the ability to create their own card, customize it with style, go through validations and the card number will be generated automatically. They will also have the option to block or delete the card. Additionally, users will be able to make transfers via Pix and view their bank statement. To encourage savings, we implemented 'Poupa Herói', where users who leave their money in savings will see the income generated in CDI directed to children and adolescents. As a reward, users will also have the chance to earn cashback.",
        "text-project-color": "This is one of the first challenges I use JavaScript, but it has special content. Although it still contains some errors, This illustration of the challenge shows how it evolves over time. In this case, allow the user to encrypt any kernel, and Circle will support that kernel. By clicking on the desired color, The main circle also takes on the same color.",

        "suggestion": "suggestion",

        "contact":"contact",
        "object":"object",
        "programmer": "be a programmer...",
        "knowledge":"knowledge",
        "mentors": "mentors",
        "madeby": "made by"


    }
}