    {
        "translation": {
            "slate": "Ardoise",
            "dark": "Zinc Foncé",
            "teal":"Sarcelle",
            "gray":"Gris",
            "System": "Système",
            "welcome": "Bienvenue sur mon portfolio!",
            "presentation": "Bonjour, je m'appelle",
            "about": "J'ai une passion pour le domaine de la programmation et je suis déterminé à conquérir mon espace. N'hésitez pas à explorer mon portfolio planétaire et à découvrir mon travail.",
            "curriculum":"Programme..",
            "start": "Commencer",
            "aboutBtn": "Á propos",
            "skills": "Compétences",
            "project": "Projet",
            "comment":"Commentaire",
            "hiring": "Engagez moi",
            "name": "Nom",
            "email": "E-mail",
            "message": "Message",
            "toSend": "Envoyer",

            "exploration-about-me": "Exploration à propos de moi",
            "country-state": "Brésil - São Paulo",
            "btn-explore-city": "Explorez ma ville",
            "info-img": "+ d'informations cliquez simplement sur l'image",
            "about-where-I-live": "Né à Suzano, je suis né dans une famille de guerriers, avec mes parents et cinq frères. Aujourd'hui, Après beaucoup de persévérance et de réalisations, Nous résidons fièrement dans la même ville de Ferraz de Vasconcelos depuis plus de 22 ans.",
            "info-city": "J'habite dans l'état de São Paulo - population IBGE 21,9%",
            "information-ships": "Informations - Navires",
            "choose-your-spaceship": "Choisissez votre vaisseau spatial",
            "cargo-spaceship": "vaisseau spatial cargo",
            "title-choose-your-spaceship":"Choisissez un vaisseau spatial pour explorer la planète Portfolio",
            "resistance-spaceship": "vaisseau spatial de résistance",
            "power-spaceship": "vaisseau spatial de puissance",
            "agility-spaceship": "Vaisseau spatial d'agilité",
            "speed-spaceship": "vaisseau spatial de vitesse",
            "camouflage-spaceship": "Vaisseau spatial camouflé",
            "level": "Niveau",
            "origin": "Origine",
            "dream-career": "Rêve - Carrière",
            "dream-profession":" Choisissez le métier de vos rêves",
            "dream": "Mon rêve est de devenir programmeur front-end",
            "coffee": "café",
            "dexterity": "dextérité",
            "sleep": "dormir",
            "intelligence": "intelligence",
            "dreamy": "rêveur",
            "choose-dream": "Choisissez le métier de vos rêves",
            "doctor": "médecin",
            "attorney": "avocat",
            "pilot": "pilote",
            "developer": "programmeur",
            "teacher": "professeur",
            "fireman": "Pompier",
            "character":"sélectionner parmi caractère",

            "title-skills": "compétences",
            "info-img-click": "+ d'informations cliquez sur les images",
            "javascript": "J'ai commencé mon parcours de programmation avec la logique de programmation en regardant les vidéos de Guanabara sur Visualg. Au fil du temps, j’ai amélioré mes connaissances et suis passé à JavaScript. Au début, il était difficile de comprendre comment travailler avec des événements, des classes et des objets, mais avec détermination et de persévérance, j'ai commencé à comprendre ces concepts. Aujourd'hui, je suis capable de créer des applications en utilisant JavaScript avec confidence.",
            "period": "période",
            "years": "années",
            "year": "année",
            "months": "mois",
            "html": "HMTL (langage de balisage hypertexte) : C'était la première fois que je mettais un ' h1 ' avec le message ' Hello, World! ' dans le code. Je n'oublierai jamais ce moment; J’étais extrêmement heureux de voir quelque chose d’aussi simple, mais percutant, apparaître sur l’écran du navigateur. C'était l'un des des moments pionniers qui ont renforcé ma passion pour le développement front-end.",
            "css": "CSS est un outil incroyable pour tous ceux qui rêvent de devenir front-end. Nous savons à quel point c'est impressionnant elle peut l'être lorsqu'il s'agit d'éléments de style. Sur mon chemin, j'ai rencontré de nombreuses difficultés dans la partie flexbox, Mais avec beaucoup de persévérance, j'ai réussi à apprendre, et aujourd'hui, le style des composants est devenu l'une des choses les plus enrichissantes. faire. Actuellement, j'utilise Styled-Components et Tailwind CSS.",
            "typescript": "Je commence à gagner en confiance dans la création d'applications TypeScript, notamment en raison de la sécurité fournis par les types. Je pense qu'avec TypeScript, j'ai la possibilité de développer des applications plus volumineuses avec plus de tranquillité d'esprit.",
            "node": "J'aime beaucoup le développement front-end, mais je reconnais qu'un bon développeur doit comprendre comment les données sont transmises. J'ai donc commencé à étudier Node.js pour comprendre le fonctionnement du backend et, en même temps, créer des projets qui intègrent le front-end et le back-end.",
            "react": "React était la bibliothèque à laquelle je m'identifiais le plus, à la fois pour la façon dont elle organise les dossiers et pour la façon dont de gérer des itinéraires et des bibliothèques que vous pouvez ajouter à vos projets pour faciliter les choses. C'est actuellement la bibliothèque ce que j'aime le plus.",
            "next": "Je me familiarise avec Next.js, un framework qui suit la même structure que React, et je n'ai aucune difficulté. J'utiliserai probablement ce framework dans mes futurs projets, car la façon dont il gère le déploiement est très simple. et efficace pour faire connaître mes projets.",
            "sqlite": "Lorsque je développe des applications impliquant le front-end et le back-end, j'apprécie vraiment utiliser SQLite3 en raison de sa simplicité dans la connexion à la base de données. Actuellement, je préfère utiliser à la fois MySQL et SQLite3.",
            
            "missions": "missions accomplies",
            "title-project": "projet",
            "text-projects": "Ce projet permet aux utilisateurs de créer leurs propres phrases en anglais, passer par plusieurs validations, dont la détection de phrases identiques, phrases de moins de trois mots et possibilité de filtrer, page supprimer et même modifier des phrases. En outre, offre une option de pratique pour améliorer les compétences en anglais.",
            "hardware": "matériel",
            "code": "code de projet",
            "see": "voir le projet",
            "text-project-sigma": "Les utilisateurs auront la possibilité de créer leur propre carte, de la personnaliser avec style, de passer par les validations et le numéro de carte sera généré automatiquement. Ils auront également la possibilité de bloquer ou de supprimer la carte. De plus, les utilisateurs pourront effectuer des virements via Pix et consulter leur relevé bancaire. Pour encourager l'épargne, nous avons mis en place « Poupa Herói », où les utilisateurs qui laissent leur argent en épargne verra les revenus générés en CDI dirigés vers les enfants et les adolescents. En récompense, les utilisateurs auront également la possibilité de gagner du cashback.",
            "text-project-color": "C'est l'un des premiers défis que j'utilise JavaScript, mais il a un contenu spécial. Bien qu'il contienne encore quelques erreurs, Cette illustration du défi montre comment il évolue au fil du temps. Dans ce cas, autorisez l'utilisateur à chiffrer n'importe quel noyau, et Circle prendra en charge ce noyau. En cliquant sur la couleur souhaitée, Le cercle principal prend également la même couleur."
        }
    }