{
    "translation": {
        "slate": "Ardósia",
        "dark": "Zinco Escuro",
        "teal":"Verde-azulado",
        "gray":"Cinza",
        "system": "Sistema",
        "sun":"sol",
        "info-sun":"O Sol é a estrela do sistema solar.  Todos os corpos celestes desse sistema, inclusive a Terra  O Sol é a estrela do sistema solar tem um diâmetro de 1,392 mi de km.",
        "earth": "terra",
        "info-earth":"A Terra foi formada há cerca de 4,5 bilhões de anos, está localizado no meio da Via Láctea, sendo o terceiro planeta mais próximo do Sol, distância 149.600.000.",
        "mars":"marte",
        "info-mars":"O planeta Marte é o quarto mais próximo do Sol Marte tem duas luas chamadas Fobos e Deimos distância do sol 227.940.000",
        "welcome": "Seja bem-vindo ao meu Portfólio!",
        "presentation": "olá, meu nome é",
        "about": "Tenho paixão pela área de Programação e estou determinado a conquistar meu espaço. Sinta-se à vontade de explorar meu portfólio planetário e conhecer meu trabalho.",
        "curriculum":"Curriculo",
        "start": "Inicio",
        "aboutBtn": "Sobre mim",
        "skills": "Habilidades",
        "project": "Projeto",
        "comment":"Comentar",
        "hiring": "Me contrate!",
        "name": "Nome",
        "email": "E-mail",
        "message": "Messagem",
        "toSend": "Enviar",

        "exploration-about-me": "Exploração sobre mim",
        "country-state": "Brasil - São Paulo",
        "btn-explore-city": "Explore minha cidade",
        "info-img": "+ informações só clicar na imagem",
        "about-where-I-live": "Natural de Suzano, eu nasci em uma família de guerreiros, com meus pais e cinco irmãos. Hoje, após muita perseverança e conquistas, nós estamos orgulhosamente residindo na mesma cidade de Ferraz de Vasconcelos há mais de 22 anos.",
        "info-city": "moro no estado de São Paulo - população IBGE 21.9%",
        "information-ships": "Informações - Naves",
        "choose-your-spaceship": "Escolha sua Espaçonave",
        "cargo-spaceship": "Espaçonave de carga",
        "title-choose-your-spaceship": " Escolha espaçonave pra explorar planeta Portfolio",
        "resistance-spaceship": "Espaçonave de Resistencia",
        "power-spaceship": "Espaçonave de força",
        "agility-spaceship": "Espaçonave de Agilidade",
        "speed-spaceship": "Espaçonave de velocidade",
        "camouflage-spaceship": "Espaçonave de Camuflagem",
        "level": "Nivel",
        "origin": "Origem",
        "dream-career": "Sonho - Carreira",
        "dream-profession": "Escolha Profissão do sonho",
        "dream": "Meu sonho é ser um programador front-end",
        "coffee": "café",
        "dexterity": "destreza",
        "sleep": "sono",
        "intelligence": "inteligência",
        "dreamy": "sonhador",
        "choose-dream": "Escolha sua profissão do sonho",
        "doctor": "médico",
        "attorney": "Advogado",
        "pilot": "piloto",
        "developer": "Programador",
        "teacher": "Professor",
        "fireman": "Bombeiro",
        "character":"selecione de personagem",

        "title-skills": "Habilidades",
        "info-img-click": "+ informações clicar nas imagens",
        "javascript": " Comecei minha jornada na programação com a lógica de programação, assistindo aos vídeos do Guanabara no Visualg. Com o tempo, fui aprimorando meus conhecimentos e avancei para o JavaScript. No início, foi desafiador compreender como trabalhar com eventos, classes e objetos, mas com determinação e perseverança, comecei a entender esses conceitos. Hoje, sou capaz de criar aplicações utilizando o JavaScript com confiança.",
        "period": "periodo",
        "years": "anos",
        "year": "ano",
        "months": "meses",
        "html": "HTML (linguagem de marcação de hipertexto): Foi a primeira vez que coloquei um 'h1' com a mensagem ' Hello, World! ' no código. Eu nunca esquecerei aquele momento; Fiquei imensamente feliz em ver algo tão simples, mas impactante, aparecer na tela do navegador. Este foi um dos momentos pioneiros que fortaleceram minha paixão pelo desenvolvimento front-end.",
        "css": "CSS é uma ferramenta incrível para quem sonha em se tornar um front-end. Sabemos o quão impressionante ela pode ser quando se trata de elementos de estilo. No caminho enfrentei muitas dificuldades na parte do flexbox, Mas com muita perseverança consegui aprender e hoje estilizar componentes se tornou uma das coisas mais gratificantes pendência. Atualmente, uso Styled-Components e Tailwind CSS.",
        "typescript": "Estou começando a ganhar mais confiança na criação de aplicações TypeScript, principalmente devido à segurança fornecidos pelos tipos. Sinto que com o TypeScript tenho a capacidade de desenvolver aplicativos maiores com mais tranquilidade.",
        "node": " Gosto muito do desenvolvimento front-end, mas reconheço que um bom desenvolvedor precisa compreender como os dados são transmitidos. Por isso, comecei a estudar Node.js para entender o funcionamento do backend e, ao mesmo tempo, criar projetos que integram o front-end e o backend.",
        "react": "React foi a biblioteca com a qual mais me identifiquei, tanto pela forma de organizar pastas quanto pela maneira de gerenciar rotas e pelas bibliotecas que você pode adicionar aos seus projetos para facilitar. Atualmente é a biblioteca que mais gosto.",
        "next": "Estou me familiarizando com o Next.js, um framework que segue a mesma estrutura do React, e não estou tendo dificuldades. Provavelmente, utilizarei esse framework em meus projetos futuros, pois a forma como ele lida com o deploy é muito simples e eficaz para divulgar meus projetos.",
        "sqlite": "Quando desenvolvo aplicações que envolvem o front-end e o back-end, aprecio bastante o uso do SQLite3 devido à simplicidade na conexão com o banco de dados. Atualmente, tenho preferência por utilizar tanto o MySQL quanto o SQLite3.",
        
        "missions": "missões concluidas",
        "title-project": "projeto",
        "text-projects": "Este projeto permite aos usuários criar suas próprias frases em inglês, passando por diversas validações, incluindo detecção de frases idênticas, frases com menos de três palavras e a capacidade de filtrar, paginar exclua e até edite frases. Além disso, oferece uma opção prática para melhorar as habilidades de inglês.",
        "hardware": "ferramentas",
        "code": "código do projeto",
        "see": "ver o video projeto",
        "see-the-project": "veja o projeto",
        "text-project-sigma": "O usuário poderá criar seu próprio cartão, personalizá-lo com estilo, passar por validações e o número do cartão será gerado automaticamente. Eles também terão a opção de bloquear ou excluir o cartão. Além disso, os usuários poderão fazer transferências via Pix e visualizar seu extrato bancário. Para incentivar a poupança, implementámos o 'Poupa Herói', onde os utilizadores que deixam o seu dinheiro na poupança verá a renda gerada em CDI direcionada para crianças e adolescentes. Como recompensa, os usuários também terão a chance de ganhar cashback.",
        "text-project-color": "Este é um dos primeiros desafios que utilizo JavaScript, mas tem um conteúdo especial. Embora ainda contenha alguns erros, Esta ilustração do desafio mostra como ele evolui ao longo do tempo. Nesse caso, permita que o usuário criptografe qualquer kernel e o Circle oferecerá suporte a esse kernel. Ao clicar na cor desejada, O círculo principal também assume a mesma cor.",
    
        "suggestion": "sugestão",

        "contact":"contato",
        "object":"objeto",
        "programmer": "ser programador...",
        "knowledge":"conhecimento",
        "mentors": "mentores",
        "madeby": "feito por"
    }

}